<h1>Numpy</h1>

Jupyter Notebook Tips and tricks eg. ctrl +shift+p : https://www.dataquest.io/blog/jupyter-notebook-tips-tricks-shortcuts/

https://learn.microsoft.com/en-us/training/modules/explore-analyze-data-with-python/3-exercise-explore-data?source=learn

<p>Mathematical tool and offers mathematical functions

- Lists are not optimized for numeric analysis. We use <b>NumPy arrays</b> : has specific data types and functions to work with Numbers in Python

<h4> Data Science Process</h4>
<p>
1. Clean data to handle errors, missing values, and other issues.
2. Apply statistical techniques to better understand the data, and how the sample might be expected to represent the real-world population of data, allowing for random variation
3. Visualize data to determine relationships between variables, and in the case of a machine learning project, identify features that are potentially predictive of the label.
Revise the hypothesis and repeat the process.
</p>

In [1]:
# !pip install numpy
import numpy as np

In [2]:
# excel for Python. Easily used with data tables
# Manipulate and analyses data
data = [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]


grades = np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

In [3]:
# difference between list and np.array.
#If multiple nparray multiples the values but list replicates the values

print(type(data),"The list multiplied becomes: ",data*2)
print('---'*8)
print(type(grades),"The numpy array multiplied becomes: ",grades*2)

#The nd indicates that this is a structure that can consists of multiple dimensions (it can have n dimensions).

<class 'list'> The list multiplied becomes:  [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
------------------------
<class 'numpy.ndarray'> The numpy array multiplied becomes:  [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [4]:
grades.shape #returns (22,)
grades.shape[0] #return 22
# the grades only has one dimension

22

In [5]:
#average
grades.mean()

49.18181818181818

In [6]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
student_data = np.array([study_hours,grades])

student_data
# It becomes a 2D Because it is an array of arrays

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

In [7]:
student_data.shape
#2 rows: study hours and grades ; 22 columns

(2, 22)

In [8]:
avg_study = student_data[0].mean()
avg_grade = student_data[1].mean()

print('Average study hours : {:.2f} \n Average Grade is {:.2f}'.format(avg_study, avg_grade))

Average study hours : 10.52
 Average Grade is 49.18

<h1>Pandas</h1>
- More convenient structure to work with tabular data (2D data in a table) <b>Data Frame</b>
- Data frame has <i>Index </i> to identify each row

In [9]:
!pip install pandas
import pandas as pd

[notice] A new release of pip available: 22.2.2 -> 22.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (1.5.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.23.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.5)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [10]:
df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

<b> Loc </b> is used to find and filter values for a specific index value or row

In [11]:
df_students.loc[5]
'''
Returns
Name          Vicky
StudyHours      1.0
Grade           3.0
'''
# Returns a range of values from 0 to 5
df_students.loc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

<b>Iloc</b> is used to find rows based on their position in the DataFrame eg. the first 5 rows in data frame

In [12]:
df_students.iloc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

In [13]:
# Find the first two values in row 0 of student data that is studyHours 
df_students.iloc[0,[1,2]]

StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

The Loc Method can be used with Filtering

In [ ]:
# Row 0 Column Grade
df_students.loc[0,'Grade']

50.0

In [ ]:
df_students.loc[df_students['Name']=='Aisha']
# OR 
df_students[df_students['Name']=='Aisha']
# OR 
df_students.query('Name == "Aisha"')
# OR
df_students[df_students.Name == 'Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

In [67]:
# !pip install wget
!python -m wget https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv
df_students = pd.read_csv('grades.csv')
df_students.head()
df_students.shape

Saved under grades (2).csv

(24, 3)

<h3><u>Finding Null Values</u></h3>
1. using isnull()</br>
2. using isnull().sum()

In [23]:
df_students.isnull()
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [27]:
# To see them in context, we can filter the dataframe to include only rows 
# where any of the columns (axis 1 of the DataFrame) are null. 
df_students[df_students.isnull().any(axis=1)]
# When the DataFrame is retrieved, the missing numeric values show up as NaN (not a number)

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

<h1>Solving for null values</h1>
1. <b>Replacing NaN with the mean values using fillna()</b><br>
2. <b>Drop NaN with the mean values using dropna()</b>

In [31]:
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())
df_students.loc[df_students['Name']=='Ted']

   Name  StudyHours  Grade
23  Ted   10.413043    NaN

In [ ]:
# drop rows (Axis 0) where any of the columns has null values
df_students = df_students.dropna(axis=0, how='any')
df_students

<h1><u><b>Exploratory Data Analysis(EDA)</b></u></h1>

<b>1. MEAN </b>

In [69]:
#Mean with column name as index and property
mean_study = df_students['StudyHours'].mean()
mean_study
#OR
mean_study = df_students.StudyHours.mean()
mean_study
print(f'The average weekly study is {mean_study:.2f}')
df_students

The average weekly study is 10.41

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True
22       Bill        8.00    NaN  False
23        Ted         NaN    NaN  False

<b>2. Filter those who studied more than average</b>

In [71]:
# returns those who studied more than the mean 
df_students[df_students.StudyHours > mean_study]
# Names of those more than the mean
df_students[df_students.StudyHours > mean_study].Name
# count the number of those who studied more than the mean
df_students[df_students.StudyHours > mean_study].Name.count()

1         Joann
3         Rosie
6      Frederic
9      Giovanni
10    Francesca
11        Rajab
14        Jenny
19         Skye
20       Daniel
21        Aisha
Name: Name, dtype: object

In [73]:
# Mean grade of those who study more than the average time
df_students[df_students.StudyHours > mean_study].Grade.mean()

66.7

<b>3. Adding a Pandas Column to the DataFrame with a pass/fail indicator</b>

In [86]:
# Add pandas series with a pass/fail indicator
# passes  = pd.Series(df_students['Grade'] >= 60)
# df_students = pd.concat([df_students, passes.rename("Pass")], axis=1)
# # del df_students["Pass"]



passed_students= df_students.loc[df_students['Pass'] == True]
#OR
passed_students = df_students[df_students['Pass']==True]
passed_students

         Name  StudyHours  Grade  Pass
3       Rosie       16.00   97.0  True
9    Giovanni       14.50   74.0  True
10  Francesca       15.50   82.0  True
11      Rajab       13.75   62.0  True
14      Jenny       15.50   70.0  True
20     Daniel       12.50   63.0  True
21      Aisha       12.00   64.0  True

<b> 4. GROUP BY</b>

In [89]:
print(df_students.groupby(df_students.Pass).Name.count())

Pass
False    17
True      7
Name: Name, dtype: int64

In [94]:
print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

       StudyHours      Grade
Pass
False    8.734375  38.000000
True    14.250000  73.142857

C:\Users\Admin\AppData\Local\Temp\ipykernel_8156\2502225861.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

In [95]:
# Create a DataFrame with the data sorted by Grade (descending)
df_students = df_students.sort_values('Grade', ascending=False)

# Show the DataFrame
df_students

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
1       Joann       11.50   50.0  False
0         Dan       10.00   50.0  False
4       Ethan        9.25   49.0  False
18      Anila       10.00   48.0  False
2       Pedro        9.00   47.0  False
7      Jimmie        9.00   42.0  False
12    Naiyana        9.00   37.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
15     Jakeem        8.00   27.0  False
8      Rhonda        8.50   26.0  False
13       Kian        8.00   15.0  False
5       Vicky        1.00    3.0  False
22       Bill        8.00    NaN  False
23        Ted         NaN    NaN  False